| T1082 — System Information Discovery
| Splunk Detection Rule
| Author: Joseph De Santiago
| Date: 2026-04-13
| Severity: Low
| Tactic: Discovery
| Technique: T1082

(index=soc-lab-ad OR index=sysmon-ad)
(
  (EventCode=4688
    (Process_Command_Line="*systeminfo*"
    OR Process_Command_Line="*hostname*"
    OR Process_Command_Line="*whoami*"
    OR Process_Command_Line="*MachineGuid*"))
  OR
  (EventCode=1
    (CommandLine="*systeminfo*"
    OR CommandLine="*hostname*"
    OR CommandLine="*whoami*"
    OR CommandLine="*MachineGuid*"))
)
| eval technique="T1082 - System Information Discovery"
| eval tactic="Discovery"
| eval severity="Low"
| table _time, host, User, Image, CommandLine, ParentImage, technique, tactic, severity
| sort _time
